## Data Cleaning

In [1]:
import pandas as pd
import os

In [2]:
# Creating Directory Cleaned data for storing cleaned data

directory_path = "Cleaned data"
os.makedirs(directory_path, exist_ok=True)

 ### Target

 #### S&P/Case-Shiller U.S. National Home Price Index

In [3]:
# Reading target data
target = pd.read_csv("CSUSHPISA.csv")

In [4]:
target.head()

         DATE  CSUSHPISA
0  1987-01-01     63.965
1  1987-02-01     64.424
2  1987-03-01     64.736
3  1987-04-01     65.132
4  1987-05-01     65.563

In [5]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01".

target.set_index('DATE', inplace =True)
target.rename(columns= {'CSUSHPINSA': 'target'}, inplace =True)
target.index = pd.to_datetime(target.index)
target = target["2003-09-01":"2023-09-01"]

In [6]:
target.shape

(241, 1)

In [7]:
target.to_csv("Cleaned data/target.csv")

### Population

#### Population includes resident population plus armed forces overseas.

In [8]:
population = pd.read_csv('POP.csv')

In [9]:
population.head()

         DATE       POP
0  1952-01-01  156309.0
1  1952-02-01  156527.0
2  1952-03-01  156731.0
3  1952-04-01  156943.0
4  1952-05-01  157140.0

In [10]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01".

population.set_index('DATE', inplace =True)
population.rename(columns= {'POP': 'population'}, inplace =True)
population.index = pd.to_datetime(population.index)
population = population["2003-09-01":"2023-09-01"]

In [11]:
population.shape

(241, 1)

In [12]:
population.to_csv('Cleaned data/population.csv')

### Personal Income

#### Income that persons receive in return for their provision of labor, land, and capital used in current production and the net current transfer payments that they receive from business and from government.

In [13]:
income = pd.read_csv('PI.csv')

In [14]:
income.head()

         DATE     PI
0  1959-01-01  391.8
1  1959-02-01  393.7
2  1959-03-01  396.5
3  1959-04-01  399.9
4  1959-05-01  402.4

In [15]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

income.set_index('DATE', inplace =True)
income.rename(columns= {'PI': 'income'}, inplace =True)
income.index = pd.to_datetime(income.index)
income = income["2003-09-01":"2023-09-01"]

In [16]:
income.shape

(241, 1)

In [17]:
income.to_csv("Cleaned data/income.csv")

### Gross Domestic Product

#### Featured measure of U.S. output, is the market value of the goods and services produced by labor and property located in the United States.

In [18]:
gdp = pd.read_csv("GDP.csv")

In [19]:
gdp.head()

         DATE      GDP
0  1947-01-01  243.164
1  1947-04-01  245.968
2  1947-07-01  249.585
3  1947-10-01  259.745
4  1948-01-01  265.742

In [20]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

gdp.set_index('DATE', inplace =True)
gdp.index = pd.to_datetime(gdp.index)

# Resampling
gdp = gdp.resample('M').ffill()

# # Set the day of the index to 1
gdp.index = gdp.index.map(lambda x: x.replace(day=1))
gdp = gdp["2003-09-01":"2023-09-01"]

In [21]:
gdp.shape

(239, 1)

In [22]:
gdp.to_csv("Cleaned data/gdp.csv")

### Unemployment Rate

#### The unemployment rate represents the number of unemployed as a percentage of the labor force. (20 years age or above)

In [23]:
unemployed_rate = pd.read_csv('UNRATE.csv')

In [24]:
unemployed_rate.head()

         DATE  UNRATE
0  1948-01-01     3.4
1  1948-02-01     3.8
2  1948-03-01     4.0
3  1948-04-01     3.9
4  1948-05-01     3.5

In [25]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

unemployed_rate.set_index('DATE', inplace =True)
unemployed_rate.rename(columns= {'UNRATE': 'unemployed_rate'}, inplace =True)
unemployed_rate.index = pd.to_datetime(unemployed_rate.index)
unemployed_rate = unemployed_rate["2003-09-01":"2023-09-01"]

In [26]:
unemployed_rate.shape

(241, 1)

In [27]:
unemployed_rate.to_csv("Cleaned data/unemployed_rate.csv")

### Mortgage Rate

#### A mortgage rate is the interest rate charged for a home loan.(Percentage)

In [28]:
mortgage =pd.read_csv("MORTGAGE30US.csv")

In [29]:
mortgage.head()

         DATE  MORTGAGE30US
0  1971-04-02          7.33
1  1971-04-09          7.31
2  1971-04-16          7.31
3  1971-04-23          7.31
4  1971-04-30          7.29

In [30]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

mortgage.set_index('DATE', inplace =True)
mortgage.rename(columns= {'MORTGAGE30US': 'mortgage_rate'}, inplace =True)
mortgage.index = pd.to_datetime(mortgage.index)
mortgage = mortgage["2003-09-01":"2023-09-01"]

In [31]:
mortgage.shape

(1044, 1)

In [32]:
mortgage.to_csv("Cleaned data/mortgage.csv")

### Employment-Population Ratio (emratio)

In [33]:
emratio = pd.read_csv("EMRATIO.csv")

In [34]:
emratio.head()

         DATE  EMRATIO
0  1948-01-01     56.6
1  1948-02-01     56.7
2  1948-03-01     56.1
3  1948-04-01     56.7
4  1948-05-01     56.2

In [35]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

emratio.set_index('DATE', inplace =True)
emratio.rename(columns= {'EMRATIO': 'emratio'}, inplace =True)
emratio.index = pd.to_datetime(emratio.index)
emratio = emratio["2003-09-01":"2023-09-01"]

In [36]:
emratio.shape

(241, 1)

In [37]:
emratio.to_csv("Cleaned data/emratio.csv")

### Building Construction issued permit in US (Total Units)

In [38]:
permit = pd.read_csv("PERMIT.csv")

In [39]:
permit.head()

         DATE  PERMIT
0  1960-01-01  1092.0
1  1960-02-01  1088.0
2  1960-03-01   955.0
3  1960-04-01  1016.0
4  1960-05-01  1052.0

In [40]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

permit.set_index('DATE', inplace =True)
permit.rename(columns= {'PERMIT': 'permit'}, inplace =True)
permit.index = pd.to_datetime(permit.index)
permit = permit["2003-09-01":"2023-09-01"]

In [41]:
permit.shape

(241, 1)

In [42]:
permit.to_csv("Cleaned data/permit.csv")

### Labor Force Participation Rate

#### The participation rate is the percentage of the population that is either working or actively looking for work.

In [43]:
labor_percent = pd.read_csv("CIVPART.csv")

In [44]:
labor_percent.head()

         DATE  CIVPART
0  1948-01-01     58.6
1  1948-02-01     58.9
2  1948-03-01     58.5
3  1948-04-01     59.0
4  1948-05-01     58.3

In [45]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

labor_percent.set_index('DATE', inplace =True)
labor_percent.rename(columns= {'CIVPART': 'labor_percent'}, inplace =True)
labor_percent.index = pd.to_datetime(labor_percent.index)
labor_percent = labor_percent["2003-09-01":"2023-09-01"]

In [46]:
labor_percent.shape

(241, 1)

In [47]:
labor_percent.to_csv("Cleaned data/labor_percent.csv")

### Monthly Supply of New Houses in the United States

#### The monthy supply is the ratio of new houses for sale to new houses sold.

In [48]:
monthly_supply = pd.read_csv("MSACSR.csv")

In [49]:
monthly_supply.head()

         DATE  MSACSR
0  1963-01-01     4.7
1  1963-02-01     6.6
2  1963-03-01     6.4
3  1963-04-01     5.3
4  1963-05-01     5.1

In [50]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

monthly_supply.set_index('DATE', inplace =True)
monthly_supply.rename(columns= {'MSACSR': 'monthly_supply'}, inplace =True)
monthly_supply.index = pd.to_datetime(monthly_supply.index)
monthly_supply = monthly_supply["2003-09-01":"2023-09-01"]

In [51]:
monthly_supply.shape

(241, 1)

In [52]:
monthly_supply.to_csv("Cleaned data/monthly_supply.csv")

### Housing starts (New Housing Project)

#### This is a measure of the number of units of new housing projects started in a given period.

In [53]:
House_starts = pd.read_csv("HOUST.csv")

In [54]:
House_starts.head()

         DATE   HOUST
0  1959-01-01  1657.0
1  1959-02-01  1667.0
2  1959-03-01  1620.0
3  1959-04-01  1590.0
4  1959-05-01  1498.0

In [55]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

House_starts.set_index('DATE', inplace =True)
House_starts.rename(columns= {'HOUST': 'house_st'}, inplace =True)
House_starts.index = pd.to_datetime(House_starts.index)
House_starts = House_starts["2003-09-01":"2023-09-01"]

In [56]:
House_starts.shape

(241, 1)

In [57]:
House_starts.to_csv("Cleaned data/House_starts.csv")

### Median Sales Price.

#### Median Sales Price of Houses Sold for the United States.(US Dollers)

In [58]:
MSPUS = pd.read_csv("MSPUS.csv")

In [59]:
MSPUS.head()

         DATE    MSPUS
0  1963-01-01  17800.0
1  1963-04-01  18000.0
2  1963-07-01  17900.0
3  1963-10-01  18500.0
4  1964-01-01  18500.0

In [60]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"
MSPUS.set_index('DATE', inplace =True)
MSPUS.index = pd.to_datetime(MSPUS.index)

# Resampling
MSPUS = MSPUS.resample('M').ffill()

# # Set the day of the index to 1
MSPUS.index = MSPUS.index.map(lambda x: x.replace(day=1))
MSPUS = MSPUS["2003-09-01":"2023-09-01"]

In [61]:
MSPUS.shape

(239, 1)

In [62]:
MSPUS.to_csv("Cleaned data/MSPUS.csv")

### Producer Price Index -Cement Manufacturing

In [63]:
PPI_Cement = pd.read_csv("PCU32733273.csv")

In [64]:
PPI_Cement.head()

         DATE  PCU32733273
0  2003-12-01        100.0
1  2004-01-01        100.9
2  2004-02-01        101.7
3  2004-03-01        101.7
4  2004-04-01        102.4

In [65]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

PPI_Cement.set_index('DATE', inplace =True)
PPI_Cement.rename(columns= {'PCU32733273': 'PPI_Cement'}, inplace =True)
PPI_Cement.index = pd.to_datetime(PPI_Cement.index)
PPI_Cement = PPI_Cement["2003-09-01":"2023-09-01"]

In [66]:
PPI_Cement.shape

(238, 1)

In [67]:
PPI_Cement.to_csv("Cleaned data/PPI_Cement.csv")

### Producer Price Index by Industry: Concrete Brick

In [68]:
PPI_Concrete = pd.read_csv("PCU32733132733106.csv")

In [69]:
PPI_Concrete.head()

         DATE PCU32733132733106
0  1981-06-01             100.0
1  1981-07-01                 .
2  1981-08-01                 .
3  1981-09-01                 .
4  1981-10-01                 .

In [70]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

PPI_Concrete.set_index('DATE', inplace =True)
PPI_Concrete.rename(columns= {'PCU32733132733106': 'PPI_Concrete'}, inplace =True)
PPI_Concrete.index = pd.to_datetime(PPI_Concrete.index)
PPI_Concrete = PPI_Concrete["2003-09-01":"2023-09-01"]

In [71]:
PPI_Concrete.shape

(241, 1)

In [72]:
PPI_Concrete.to_csv("Cleaned data/PPI_Concrete.csv")

### All Employees, Residential Building Construction (Thousands of Peoples)

#### Construction employees in the construction sector include: Working supervisors, qualified craft workers, mechanics, apprentices, helpers, laborers, and so forth, engaged in new work, alterations, demolition, repair, maintenance etc.

In [73]:
all_Const_Emp = pd.read_csv("CES2023610001.csv")

In [74]:
all_Const_Emp.head()

         DATE  CES2023610001
0  1985-01-01          650.5
1  1985-02-01          643.4
2  1985-03-01          651.8
3  1985-04-01          655.2
4  1985-05-01          659.8

In [75]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

all_Const_Emp.set_index('DATE', inplace =True)
all_Const_Emp.rename(columns= {'CES2023610001': 'all_Const_Emp'}, inplace =True)
all_Const_Emp.index = pd.to_datetime(all_Const_Emp.index)
all_Const_Emp = all_Const_Emp["2003-09-01":"2023-09-01"]

In [76]:
all_Const_Emp.shape

(241, 1)

In [77]:
all_Const_Emp.to_csv("Cleaned data/all_Const_Emp.csv")

### All Employees, Construction (Thousands of persons)

#### Construction employees in the construction sector include: Working supervisors, qualified craft workers, mechanics, apprentices, helpers, laborers, and so forth, engaged in new work, alterations, demolition, repair, maintenance.

In [78]:
total_emp_cons = pd.read_csv("USCONS.csv")

In [79]:
total_emp_cons.head()

         DATE  USCONS
0  1939-01-01    1139
1  1939-02-01    1162
2  1939-03-01    1225
3  1939-04-01    1249
4  1939-05-01    1262

In [80]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"
total_emp_cons.set_index('DATE', inplace =True)
total_emp_cons.rename(columns= {'USCONS': 'total_emp_cons'}, inplace =True)
total_emp_cons.index = pd.to_datetime(total_emp_cons.index)
total_emp_cons = total_emp_cons["2003-09-01":"2023-09-01"]

In [81]:
total_emp_cons.shape

(241, 1)

In [82]:
total_emp_cons.to_csv("Cleaned data/total_emp_cons.csv")

### Industrial Production: Cement

#### The industrial production (IP) index measures the real output of all relevant establishments located in the United States

In [83]:
IPI_Cement = pd.read_csv("IPN32731S.csv")

In [84]:
IPI_Cement.head()

         DATE  IPN32731S
0  1972-01-01   144.6423
1  1972-02-01   138.8505
2  1972-03-01   137.9965
3  1972-04-01   139.3841
4  1972-05-01   136.9861

In [85]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

IPI_Cement.set_index('DATE', inplace =True)
IPI_Cement.rename(columns= {'IPN32731S': 'IPI_Cement'}, inplace =True)
IPI_Cement.index = pd.to_datetime(IPI_Cement.index)
IPI_Cement = IPI_Cement["2003-09-01":"2023-09-01"]

In [86]:
IPI_Cement.shape

(240, 1)

In [87]:
IPI_Cement.to_csv("Cleaned data/IPI_Cement.csv")

### Homeownership Rate (Percentage)

#### The homeownership rate is the proportion of households that is owner-occupied.

In [88]:
home_ow_rate = pd.read_csv("RSAHORUSQ156S.csv")

In [89]:
home_ow_rate.head()

         DATE  RSAHORUSQ156S
0  1980-01-01           65.5
1  1980-04-01           65.6
2  1980-07-01           65.6
3  1980-10-01           65.6
4  1981-01-01           65.6

In [90]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

home_ow_rate.set_index('DATE', inplace =True)
home_ow_rate.index = pd.to_datetime(home_ow_rate.index)
home_ow_rate.rename(columns= {'RSAHORUSQ156S': 'home_ow_rate'}, inplace =True)

# Resampling
home_ow_rate = home_ow_rate.resample('M').ffill()

# # Set the day of the index to 1
home_ow_rate.index = home_ow_rate.index.map(lambda x: x.replace(day=1))
home_ow_rate = home_ow_rate["2003-09-01":"2023-09-01"]

In [91]:
home_ow_rate.shape

(239, 1)

In [92]:
home_ow_rate.to_csv("Cleaned data/home_ow_rate.csv")

### Personal Saving Rate (Percent)

#### Personal saving as a percentage of disposable personal income (DPI), frequently referred to as "the personal saving rate," is calculated as the ratio of personal saving to DPI. Personal income that is used either to provide funds to capital markets or to invest in real assets such as residences.

In [93]:
p_saving_rate =pd.read_csv("PSAVERT.csv")

In [94]:
p_saving_rate.head()

         DATE  PSAVERT
0  1959-01-01     11.3
1  1959-02-01     10.6
2  1959-03-01     10.3
3  1959-04-01     11.2
4  1959-05-01     10.6

In [95]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

p_saving_rate.set_index('DATE', inplace =True)
p_saving_rate.rename(columns= {'PSAVERT': 'p_saving_rate'}, inplace =True)
p_saving_rate.index = pd.to_datetime(p_saving_rate.index)
p_saving_rate = p_saving_rate["2003-09-01":"2023-09-01"]

In [96]:
p_saving_rate.shape

(241, 1)

In [97]:
p_saving_rate.to_csv("Cleaned data/p_saving_rate.csv")

### New Privately-Owned Housing Construction Completed: (Total units in thousands)

In [98]:
new_private_house = pd.read_csv("COMPUTSA.csv")

In [99]:
new_private_house.head()

         DATE  COMPUTSA
0  1968-01-01    1257.0
1  1968-02-01    1174.0
2  1968-03-01    1323.0
3  1968-04-01    1328.0
4  1968-05-01    1367.0

In [100]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

new_private_house.set_index('DATE', inplace =True)
new_private_house.rename(columns= {'COMPUTSA': 'new_private_house'}, inplace =True)
new_private_house.index = pd.to_datetime(new_private_house.index)
new_private_house = new_private_house["2003-09-01":"2023-09-01"]

In [101]:
new_private_house.shape

(241, 1)

In [102]:
new_private_house.to_csv("Cleaned data/new_private_house.csv")

### New Privately-Owned Housing Units Under Construction: Total Units in thousands

In [103]:
new_private_hw_under = pd.read_csv("UNDCONTSA.csv")

In [104]:
new_private_hw_under.head()

         DATE  UNDCONTSA
0  1970-01-01      889.0
1  1970-02-01      888.0
2  1970-03-01      890.0
3  1970-04-01      891.0
4  1970-05-01      883.0

In [105]:
# Setting DATE as index, column renaming, setting DATE as index, filtering data from "2003-09-01":"2023-09-01"

new_private_hw_under.set_index('DATE', inplace =True)
new_private_hw_under.rename(columns= {'UNDCONTSA': 'new_private_hw_under'}, inplace =True)
new_private_hw_under.index = pd.to_datetime(new_private_hw_under.index)
new_private_hw_under = new_private_hw_under["2003-09-01":"2023-09-01"]

In [106]:
new_private_hw_under.shape

(241, 1)

In [107]:
new_private_hw_under.to_csv("Cleaned data/new_private_hw_under.csv")